#include "mainwindow.h"
#include "ui_mainwindow.h"

#include <QListWidgetItem>
#include <QToolBox>
#include <QLabel>
#include <QTextEdit>




MainWindow::MainWindow(QWidget *parent)
    : QMainWindow(parent)
    , ui(new Ui::MainWindow)
{
    ui->setupUi(this);


    QString txt[25]; //https://lisova.jewelry/blog/znachenija-run
    txt[0] = "Феху";
    txt[1] = "Уруз";
    txt[2] = "Турісаз";
    txt[3] = "Ансуз";
    txt[4] = "Райдо";
    txt[5] = "Кано";
    txt[6] = "Гебо";
    txt[7] = "Вуньо";
    txt[8] = "Хагалаз";
    txt[9] = "Наутіз";
    txt[10] = "Іса";
    txt[11] = "Йера";
    txt[12] = "Ейваз";
    txt[13] = "Перт";
    txt[14] = "Альгіз";
    txt[15] = "Соул";
    txt[16] = "Тейваз";
    txt[17] = "Беркана";
    txt[18] = "Еваз";
    txt[19] = "Манназ";
    txt[20] = "Лагуз";
    txt[21] = "Інгуз";
    txt[22] = "Дагаз";
    txt[23] = "Одал";
    txt[24] = "=пуста=";

    QString txtAll[25]; //https://lisova.jewelry/blog/znachenija-run
    txtAll[0] = "Перша руна Старшого Футарка. Феху - символ багатства, благополуччя, достатку і комфорту. Вона відповідає за збереження нажитого і придбання нового.\n \
        В основному ця руна стосується матеріально успіху - грошей, майна. Але також вона відповідає за внутрішнє багатство - досвід, духовну зрілість. Вона допомагає бути мудрим і розвиватися внутрішнє.\n \
        Вважається, що талісман з руною Феху відкриває нові грошові потоки і допомагає знайти і розкрити в повній мірі всі можливі способи заробітку.\n \
        Значення руни Феху: фінансовий успіх, зручності, професійний розвиток, кар'єрне зростання, досягнення, добробут.";
    txtAll[1] = "Назва руни Уруз в перекладі означає 'сила'. Вона символізує неконтрольовану силу змін, прийдешню ззовні і необхідність оновлення.\n \
        Уруз - це полум'я, що спалює все старе і непотрібне.\n \
        Найкраще її можна описати як руну розвитку за рахунок виходу із зони комфорту.\n \
        Уруз викликає трансформацію - як зовнішню, так і внутрішню. Відсікається все непотрібне  - все, що заважає руху вперед і еволюції.\n \
        Це потужна руна і поводитися з нею потрібно акуратно, адже вихід із зони комфорту - це часто болючий і складний шлях, але абсолютно необхідний для розвитку.\n \
        Амулет з руною Уруз допоможе набратися рішучості і зробити ривок для змін. Носити руну постійно не потрібно, лише в ті моменти коли відчуваєте, що пора йти вперед, але не можете зважитися. Руна Уруз допоможе в цьому.\n \
        Якщо Ви готові прийняти силу цієї руни і хочете змін - Уруз для Вас.\n \
        Значення: придбання нової форми, трансформація, духовне зростання, перехід на новий рівень. новий світ, нові перспективи і можливості.";
    txtAll[2] = "Турісаз - складна руна, яка може працювати як на благо, так і на шкоду. З нею потрібно бути дуже обережним. Але тим людям, які по-справжньому сильні духом і рішучі в своїх прагненнях, ця руна стане вірним помічником.\n \
        Турісаз перекладається як 'ворота'. Вважається, що вона знаходиться між матеріальним світом і вищими знаннями. Ці знання і силу зможуть отримати тільки ті, хто готовий йти до кінця і проявить стійкість до ситуацій, перевіряючих силу духу.\n \
        Турісаз допомагає людині відшукати в собі стійкість і внутрішню опору, знайти силу в собі. Але це відбувається через перевірку випробуваннями і виходом із зони комфорту.\n \
        Також Турісаз допомагає бути обережним в своїх рішеннях - пригальмувати, спланувати, ретельно обміркувати і тільки тоді робити стрибок. Вона підкаже вам, де потрібно зупинитися і поглянути на факти, перш ніж прийняти безповоротне рішення.\n \
        Амулет з Турісаз допомагає рішуче, але в той же час грамотно рухатися вперед, знищуючи непотрібні стримуючі фактори. Допомагає бути більш уважним, краще аналізувати і розуміти навколишній світ, людей і ситуації.\n \
        Як і всі руни, Турісаз не працюватиме замість Вас. Вона буде працювати з Вами. І вибирати цю руну варто тільки якщо Ви готові до сміливих змін всередині і зовні, які хоч і не м'яким способом, але зроблять Вас краще і сильніше.\n \
        Значення: випробування, проходження перешкоди, витримка, самовладання, аналіз, самопізнання, різкі зміни, внутрішній стрижень, гарт характеру, стійкість.";
    txtAll[3] = "Ансуз - руна мудрості, пізнання і комунікації.\n \
        Це руна протегує людям, чий рід діяльності пов'язаний із спілкуванням. Талісман з нею допомагає бути комунікабельним, краще взаємодіяти з людьми, розуміти їх, знаходити спільну мову, покращує інтуїцію і емпатію.\n \
        Ансуз позитивно впливає на навчання і сприйняття інформації, дозволяє людині розкрити весь потенціал, внутрішні здібності і талант. Особливо це стосується сфер, де потрібно проявляти високу розумову активність.\n \
        Ця руна не тільки допомагає краще засвоювати нову інформацію, а й правильно застосовувати її на своєму життєвому шляху.\n \
        Значення: красномовство, інтелект, удача на іспитах, розкутість, мудрість, натхнення, внутрішня енергія, інтуїція, впевненість в собі, привабливість, переконливість.";
    txtAll[4] = "Райдо - руна шляху і руху.\n \
        Ця руна відмінно підходить мандрівникам і тим людям, чиє життя або робота пов'язана з дорогою і подорожами.\n \
        Але на цьому її значення не закінчується, адже шлях може бути як фізичним, так і духовним. Райдо допомагає в духовних пошуках і розвитку, направляє в області, де найкраще розкриються Ваші перспективи.\n \
        Ця руна - дороговказ. Якщо ви відчуваєте себе розгублено і не знаєте, в якому напрямку рухатися - вона допоможе відчути грунт під ногами і вибрати правильний напрямок.\n \
        Якщо ви відчуваєте, що у вас період застою - Райдо призведе в рух справи і посприяє прогресу в починаннях.\n \
        Амулет з нею використовують як оберіг і захист в подорожах.\n \
        Значення: розвиток, рух, подорож, поїздка, прогрес.";
    txtAll[5] = "Кано - руна творців, митців, музикантів і всіх, хто займається творчістю і створенням чогось. Вона символізує творчий потік, креативність, 'вогонь всередині' \n \
        Ця руна людей, які горять своєю справою і глибоко в нього занурені.\n \
        Кеназ перекладається як 'факел'. Вона ніби висвітлює все навколо Вас, призводить розум в той стан, в якому легко черпати радість і натхнення з усього навколо.\n \
        Одне з її головних значень - народження нових ідей, тому вона ідеальна для всіх, чия діяльність пов'язана з креативом, фантазією і створенням.\n \
        Амулет з руной Кано підсилює креативні здібності, змушуючи внутрішній вогонь творчості горіти яскравіше і висвітлювати все навколо.\n \
        Вона допомагає черпати життєві сили в навколишньому світі, відчувати себе повним енергії і в гаромніі зі своїм творчим 'Я'\n \
        Значення: внутрішній вогонь, натхнення, творчий потік, розкриття, світло, створення, народження ідей.";
    txtAll[6] = "Гебо - одна з найбільш сприятливих рун Старшого Футарка, так як не має перевернутого положення.\n \
        Мабуть, у неї найбільш виражене романтичне значення серед інших. Вона про міцних, щирих і рівноправних відносинах, де кожен партнер вільний, самодостатній і не обмежує іншого. Вона про збалансоване, чесному енергообміну.\n \
        Однак, Гебо важлива не тільки у відносинах романтичного плану - описане вище може бути застосовано для відносин будь-якого типу - дружніх, ділових, родинних.\n \
        Гебо допомагає підтримувати в будь-яких відносинах гармонію, рівновагу і здоровий клімат.\n \
        Амулет з цієї руною допомагає зміцнити відносини з важливими людьми. А якщо таких людей немає - знайти їх.\n \
        Назва цієї руни перекладається як 'дар', а щирі і теплі відносини - це і правда цінний дар, чи не так?\n \
        Значення: плідні щирі відносини, партнерство, союз.";
    txtAll[7] = "Вуньо - дуже світла руна. Вона завжди притягує щось хороше і сприяє настанню щасливого періоду, повного радості і гармонії.\n \
        Ця руна - про початок білій смузі в життя, про виконання давніх бажань і отриманні заслуженої нагороди за свої старання.\n \
        Зазвичай талісман з Вуньо носять щоб гармонізувати свій внутрішній настрій, стати впевненіше і скинути стримуючі кайдани страху і переживань.\n \
        Цю руну добре описує фраза 'найтемніша ніч перед світанком' - Вуньо і є цей світанок, початок змін на краще.\n \
        Значення: радість, задоволення, надія, вдосконалення, гармонія, процвітання.";
    txtAll[8] = "Руна з різкою і неконтрольованої силою.\n \
        Оновлення через руйнування. Руйнування старого укладу, який заповільнює розвиток. Хагалаз як буря - проноситься по вашому житті, перетворюючи скріпи і зручну, але стримуючу зону комфорту в руїни, на місці яких можна і потрібно почати будувати щось нове.\n \
        Вона допомагає випустити з себе, викинути все непотрібне. Це може бути складно і боляче, але кращий розвиток завжди відбувається в умовах дискомфорту, не дарма порада 'вийти із зони комфорту' така популярна.\n \
        Хагалаз буквально виносить Вас з цієї зони. Все що Вам потрібно - втримати рівновагу, дозволивши віджилим своє речей, звичок, людей і ситуацій канути в лету, очистити Ваше життя і дати простір для створення Нового.\n \
        З цієї руною потрібно бути акуратним і ретельно обміркувати, чи потрібна Вам саме Хагалаз з її різкою очищуючою дією. Це ефективно і швидко, але боляче, а тому небезпечно і важко.\n \
        Якщо Ви відчуваєте досить врутрішньої стійкості і рішучості, щоб змінити все різко тут і зараз - вона допоможе.\n \
        Значення: різкі зміни. зовнішня сила, зміни, раптові події, перевірка характеру, гарт, випробування, знищення старого порядку.";
    txtAll[9] = "Це складна руна. Використовувати Наутіз варто дуже обережно і тільки в тому випадку, якщо все зовсім погано або в комбінації з іншими рунами, сама по собі вона не дає багато користі.\n \
        Вона сприяє зміцненню врутреннего стрижня, загартуванню характеру, дисципліни. Вчить тримати себе в руках в складний період і зберігати спокій. Робить Вас сильніше, терпиміше і витривалішими, але через позбавлення, обмеження і дискомфорт. Ця руна може загнати в по-справжньому спартанські умови, з яких можна вийти або переможцем, або зламаним. Але якщо витримати всі випробування руни, то головний приз - міцний, загартований характер, який дозволить отримати від життя все, що захочете.\n \
        Значення: подолання, пересилення, гарт через складнощі, терпіння, позбавлення, обмеження, важкий період.";
    txtAll[10] = "У перекладі Іса означає 'лід'. Вона ніби заморожує звичний плин життя, змушуючи взяти паузу, озирнутися навколо, прийняти вимушену зупинку і заспокоїтися. Адже звичний ритм лишається, але не назавжди, а лише на час. І відбувається це не просто так.\n \
        Зупинка - це моральне обнулення. Ви не втрачаєте тих досягнень, які придбали, все матеріальне залишається, все навички залишаються. Ви лише пригальмовуєте, щоб остудити свідомість і переконатися, що курс обраний правильно. Щоб ще раз проаналізувати те, що робите і до чого прагнете. Подивитися на свої цілі без пелени звичної рутини і метушні, набратися нових сил.\n \
        Іса - непроста руна і носити її слід з обережністю. Вона вчить приймати тимчасові паузи в проектах і використовувати собі на благо: очищати свідомість, вчитися спокою, знаходити заспокоєння в зупинці, не боятися таких моментів і відчувати їх цінність.\n \
        Значення: зупинка, уповільнення, пауза перед успіхом, відстрочка.";
    txtAll[11] = "Руна Йера символізує завершення циклу і момент збору врожаю.\n \
        Це відноситься до всіх сфер життя. Якщо Ви старанно і довго працювали над чимось, то Йера говорить про те, що настав момент збирати плоди своєї праці.\n \
        Однак Йера НЕ символізує 'подарунок долі', значення руни - справедлива нагорода і результат за Вашу наполегливу працю.\n \
        Так як основне значення цієї руни 'врожай', її часто використовують в якості талісмана для того, щоб знайти зв'язок з природою і жити в гармонії з природними циклами.\n \
        Талісман з цієї руною носять для того, щоб всі починання завершилися сприятливо. Якщо Ви збираєтеся починати важливу справу, робити інвестиції, пробувати нові формати роботи - Йера допоможе Вам робити це найефективнішим і сприятливим способом.\n \
        Значення: збір врожаю, нагорода, завершення циклу, успішне завершення справ, відчутний результат.";
    txtAll[12] = "Якщо у вас темний період невіри в себе і здається, що плани і задуми надто складні і нездійсненні - руна Ейваз додасть сил для його подолання.\n \
        Вона стимулює креативне мислення і допомагає дивитися на питання ясно і достовірно, щоб бачити правильне рішення.\n \
        В якості талісмана Ейваз використовують для захисту від труднощів. Вона допомагає обходити гострі кути, підтримувати внутрішній баланс і плавно, але впевнено, знаходити шлях до своїх цілей.\n \
        Значення: захист, витримка, подолання, позитивне рішення.";
    txtAll[13] = "Перт - одна з найскладніших для розуміння рун.\n \
                 Її пряме значення - таємниця. Перт - це все таємне, незвідане, приховане. Ключове слово цієї руни - пошук.\n \
            Вона символізує трансформацію свідомості, переродження розуму.\n \
        Ми дорослішаємо і формуємося, наше бачення і сприйняття світу змінюється разом з нами. Все життя ми розвиваємося і шукаємо шлях до нашого внутрішнього 'Я'. Цей пошук і зміни символізує Перт.\n \
            Ця руна про усвідомленості буття, про перехід на новий рівень свідомості за рахунок переродження вашого старого 'Я' в нове і більш розвинене.\n \
            Також це сама містична руна Старшого Футарка. Амулети з нею використовують люди, які займаються різного роду магічними практиками. Вважається, що вона підсилює інтуїцію і допомагає розгледіти і витягнути на поверхню здатності, приховані всередині.\n \
            Значення: інтуїція, таємниця, дослідження, пошук, переродження.";
    txtAll[14] = "Альгиз - руна потужної захисту. Амулет з нею часто носять саме в якості оберега.\n \
        Вважається, що руна Альгіз захистить свого власника від усіх неприємностей і негараздів, навіть якщо вони будуть відбуватися зовсім поруч.\n \
        Альгіз допомагає знайти в собі сили для вирішення проблем і розвивати моральну стійкість і рішучість.\n \
        Ця руна символізує високу духовність, набуття єдності з вищою свідомістю, творчість і удачу, яка активізується, коли людина починає чути і розуміти свій внутрішній голос.\n \
        Альгіз не тільки відводить від людини все погане, але і зміцнює внутрішній дух, щоб ті речі, які раніше могли б похитнути внутрішній баланс, тепер не мали б жодної ваги.\n \
        Значення: захист, заступництво вищих сил, зв'язок з вищою свідомістю, допомога.";
    txtAll[15] = "Соулу не має перевернутого положення, це один з найбільш сприятливих символів Старшого Футарка.\n \
        Це руна внутрішнього енергетичного потоку, наповненості силами і прагненням до перемоги. Це руна тріумфу, лідерства, впевненості, наполегливості. Руна досягнення і самореалізації. Руна сонця.\n \
        Талісман з Соул допомагає мобілізувати свій внутрішній ресурс, увібрати нову енергію, заряджати і надихнутися нею, щоб використовувати в своєму шляху.\n \
        Це сильна і світла руна, яка веде свого господаря до досягнень, успіху і допомагає бути завжди в ресурсі і повним енергії.\n \
        Значення: тріумф, досягнення, сила, потік, енергія, лідерські якості, впевненість в собі, оптимізм, ентузіазм, воля до перемоги.";
    txtAll[16] = "Тейваз - руна воїна.\n \
        Вона про рух вперед і тільки вперед, що видно по самій її формі. Ця руна - символ боротьби і перемоги.\n \
        Талісман з Тейваз допомагає розвивати і зміцнювати такі якості, як відвага, сміливість, рішучість, безстрашність перед перешкодами, цілеспрямованість і впевненість у своїх силах.\n \
        Однак носити цю руну варто тільки тим людям, які готові подолати перешкоди і поборотися за свої цілі, адже Тейваз не приносить перемогу сама по собі, вона лише допомагає бути стійким і відважним на шляху до неї, а перемога досягається через боротьбу.\n \
        Ця руна не підійде тим людям, які хоча отримати що-небудь без зусиль, але якщо ви готові прикладати зусилля і наполегливо працювати над собою - вона ваш ідеальний помічник.\n \
        Значення: боротьба, заслужена справедлива перемога, стійкість, цілеспрямованість, наполегливість, відвага, моральна сила.";
    txtAll[17] = "Беркана - руна жіночої енергії.\n \
        Вона уособлює жіночність, символізує домашнє вогнище, вагітність, народження дитини, материнські якості.\n \
        Беркана допомагає жінкам в їх становленні, будь то шлях господині будинку і материнства, або ж кар'єрний ріст - головне, щоб ці наміри були щирі, чистими і не шкодили іншим.\n \
        Вона є символом не тільки народження дитини, але і процесу народження в цілому. Це може бути народження нової ідеї, проекту, плану.\n \
         Найчастіше жінки використовують амулет з руной Беркана для зміцнення жіночого здоров'я, посилення жіночої енергії, привабливості. Вона допомагає гармонізувати відносини всередині сім'ї, зробити їх більш м'якими, теплими, довірчими.\n \
        Незважаючи на те, що Беркана вважається руною жіночої енергії, вона підійде як матері, так і батьку, які хочуть налагодити, зміцнити і привнести гармонію в свої відносини з дітьми.\n \
        Люди, які займаються садівництвом, городом і подібною діяльністю носять цю руну, тому що вона символізує зростання і родючість, сприяючи хорошому врожаю.\n \
        Якщо Ви хочете додати в сімейні стосунки любові, турботи, гармонії і розуміння, зміцнити домашнє вогнище, то Беркана в цьому допоможе.\n \
        Значення: жіноча енергія, врожайність, родючість, народження, створення, зміцнення відносин, домашній затишок, міцні снмейні відносини, захист будинку, оберіг родини, турбота.";
    txtAll[18] = "Еваз - каталізатор змін, зсуву з мертвої точки, активного руху вперед і трансформації як зовнішньої - у ваших справах, навчанні, роботі, так і внутрішньої - у свідомості і способі думки.\n \
        Носити її слід тоді, коли Ви готові зануритися в низку змін, що ведуть до зростання. Еваз притягує нові можливості. Вона допомагає ефективно реалізувати задумане, бути стійким в переломні моменти і гнучко пристосовуватися до нових умов.\n \
        Також руна допомагає бачити і відсікати непотрібне, рішуче розлучатися з тим, що заважає, переходити на новий рівень розвитку як зовнішнього, так і внутрішнього.\n \
        Значення: зміни, трансформація, шлях.";
    txtAll[19] = "Манназ - руна самопізнання.\n \
        Її значення та дія унікальні для кожного, адже ця руна людської індивідуальності.\n \
        Вона вчить відчувати свій внутрішній світ, аналізувати його і те, як переломлюється навколишня дійсність під призмою вашої особистості. Вона вчить прислухатися до свого внутрішнього голосу, розуміти і приймати себе.\n \
        Манназ вчить усвідомленості і допомагає розкрити ваші найкращі якості, зрозуміти, хто Ви, навіщо живете і відчути гармонію з собою і світом.\n \
        Талісман з Манназ допоможе зрозуміти себе, якщо Ви заплуталися і вибрати правильний курс. Допоможе тверезо все проаналізувати і розставити пріоритети, зрозуміти, що по-справжньому важливо для Вас і набратися рішучості почати шлях до своїх цілей.\n \
         Значення: внутрішнє 'я', самоаналіз, занурення в думки, турбота про себе, розстановка пріоритетів, віра в себе і свої цілі, внутрішня енергія, роздуми, інтелект, самовдосконалення.";
    txtAll[20] = "Лагуз володіє містичним значенням. Ця руна тісна пов'язана з магією, містикою, інтуїцією.\n \
        Лагуз перекладається як 'вода, озеро'. Вона символізує плин життя. Руна допомагає ніби 'плисти по життю' - гладко проходити гострі кути, перебувати в потоці, м'яко, але вірно, слідувати своїм шляхом.\n \
         Ця руна вважається жіночою. Вона загострює інтуїцію, особисті сили і допомагає своїй господині розкрити її силу і внутрішній потенціал, розвинути ті сторони характеру, які жінка хоче: будь то жіночність, легкість, м'якість, або лідерство, відвага, завзяття. Сила рун вільна від стереотипів, руни - це чиста, вільна енергія. Тому Лагуз допоможе стати своїй господині тією жінкою, яку вона мріє бути.\n \
        Вважається, що Лагуз допомагає розвивати не тільки інтуїцію, але також фантазію і уяву, адже всі ці процеси тісно пов'язані - все це внутрішній світ і душа\n \
        Чоловікам Лагуз підійде в тому випадку, якщо вони пов'язані з водною стихією (робота в океані і т.д.)\n \
        Вважається, що руну Лагуз прийнято брати в подорожі на океан або море, щоб краще відчувати стихію і бути з нею в контакті\n \
        Значення: безперервне протягом життя, інтуїція, жіноча енергія, розвиток, уява, фантазія, вода.";
    txtAll[21] = "Інгуз символізує період прогресу. Період, в який все виходить. З Інгуз у Вас вийде реалізувати задумане в повній мірі, вона говорить про те, що пора розправити крила і сміливо йти на зустріч мрії, адже зараз дуже вдалий час.\n \
        Ця руна говорить вам 'час діяти, зараз або ніколи!' \n \
        Не бійтеся зануритися в щось нове, не бійтеся змінюватися. Інгуз допомагає посилити такі якості як рішучість, упевненість, сміливість, віра в себе, позитивний погляд на світ. Вона допомагає сміливо дивитися на те, що чекає Вас попереду і гідно слідувати своїм шляхом.\n \
        Почніть свій шлях, а Інгуз стане вірним помічником і підтримкою.\n \
        Значення: життєва сила, перетворення, нове народження, прогрес, розвиток, зростання.";
    txtAll[22] = "Це руна сили волі і здійснення мрій. Дагаз - один з найбільш яскравих і сильних символів Старшого Футарка.        \n \
        Вважається, що ця руна стає каталізатором низки бажаних змін, допомагає трансформувати реальність і створити для себе реальність своєї мрії.\n \
        Але ця руна допоможе лише активним людям, адже її тлумачення щільно пов'язане з силою волі. Просто так нічого не дається і Дагаз покаже свою силу лише тому, хто намагається, пробує, проявляє активність і знає, чого хоче.\n \
        Ця руна веде до самореалізації, допомагає вдосконалюватися. Тим, хто готовий працювати заради мрії, Дагаз покаже найефективніший шлях її досягнення і допоможе накопичувати енергію для цього шляху.\n \
        Значення: прорив, виконання бажань, трансформація, процвітання, шлях до мрії";
    txtAll[23] = "Руна зв'язку з Родом. Руна будинку і майна.\n \
        На відміну від Феху, Одал символізує нематеріальне майно - весь Ваш життєвий досвід. Всі знання, навички, звички, які Ви встигли придбати протягом життя.\n \
        Одал часто використовують в справах, пов'язаних з будинком і майном в якості захисного амулета. Одал допомагає захистити Будинок від побутових інцидентів: пожеж, крадіжок і так далі.\n \
        Цю руну радять мати з собою при покупці нерухомості.\n \
        Так як Одал - руна зв'язку з Родом, вона допоможе налагодити відносини з сім'єю, зміцнити їх і особливо буде корисна тим людям, у яких з родичами спільне майно або бізнес. Вона допомагає гармонізувати спілкування, зберегти баланс і справедливі відносини всередині сім'ї, розвинути спадкові здібності.\n \
        Значення: захист будинку, життєвий досвід, житло, рід, інтелектуальне майно, матеріальне майно, сімейні відносини.";
    txtAll[24] = "=пуста=";





for( short i = 0; i < 25; i++ )
    {
        QToolBox *toolbox = new QToolBox;

        QWidget* page = new QWidget;
        QGridLayout* layout = new QGridLayout(page);
        layout->setSpacing(12);
        QLabel* textLabel = new QLabel;
        QTextEdit* textEdit = new QTextEdit;

        textLabel->setText( "опис руни " + QString::number(i+1) + " " + txt[i] + " :");
        textLabel->setFont(QFont("Times", 18, QFont::AnyStyle));    // QFont serifFont("Times", 16, QFont::Bold);
        textEdit->setText(txtAll[i]);
        textEdit->scrollBarWidgets(Qt::AlignLeft);
        layout->addWidget(textLabel, 0, 0);
        layout->addWidget(textEdit, 1, 0);

        ui->toolbox->setMinimumHeight(1400);
        //ui->toolbox->setFixedHeight(1222);

        ui->toolbox->setItemIcon(0,QIcon(":/files/1.svg"));
        ui->toolbox->setItemIcon(1,QIcon(":/files/2.svg"));
        ui->toolbox->setItemIcon(2,QIcon(":/files/3.svg"));
        ui->toolbox->setItemIcon(3,QIcon(":/files/4.svg"));
        ui->toolbox->setItemIcon(4,QIcon(":/files/5.svg"));
        ui->toolbox->setItemIcon(5,QIcon(":/files/6.svg"));
        ui->toolbox->setItemIcon(6,QIcon(":/files/7.svg"));
        ui->toolbox->setItemIcon(7,QIcon(":/files/8.svg"));
        ui->toolbox->setItemIcon(8,QIcon(":/files/9.svg"));
        ui->toolbox->setItemIcon(9,QIcon(":/files/10.svg"));
        ui->toolbox->setItemIcon(10,QIcon(":/files/11.svg"));
        ui->toolbox->setItemIcon(11,QIcon(":/files/12.svg"));
        ui->toolbox->setItemIcon(12,QIcon(":/files/13.svg"));
        ui->toolbox->setItemIcon(13,QIcon(":/files/14.svg"));
        ui->toolbox->setItemIcon(14,QIcon(":/files/15.svg"));
        ui->toolbox->setItemIcon(15,QIcon(":/files/16.svg"));
        ui->toolbox->setItemIcon(16,QIcon(":/files/17.svg"));
        ui->toolbox->setItemIcon(17,QIcon(":/files/18.svg"));
        ui->toolbox->setItemIcon(18,QIcon(":/files/19.svg"));
        ui->toolbox->setItemIcon(19,QIcon(":/files/20.svg"));
        ui->toolbox->setItemIcon(20,QIcon(":/files/21.svg"));
        ui->toolbox->setItemIcon(21,QIcon(":/files/22.svg"));
        ui->toolbox->setItemIcon(22,QIcon(":/files/23.svg"));
        ui->toolbox->setItemIcon(23,QIcon(":/files/24.svg"));

        //    ui->toolBox->setSizeIncrement(QSize(0, 370) );
        //    ui->toolBox-> size(QSize(0, 370));
        ui->toolbox->addItem(page, QString::number(i+1) + " " + txt[i] );
    }
}



MainWindow::~MainWindow()
{
    delete ui;
}

